# 의존성이란

Dependency, 의존성이란? 객체 지향 프로그래밍에서 Dependency, 의존성은 서로 다른 객체 사이에 의존 관계가 있다는 것을 말한다. 즉, 의존하는 객체가 수정되면, 다른 객체도 영향을 받는다는 것이다.

ex) 

자식함수를 부모쪽에서 가져다 쓸때 의존성이 생긴다ㅏ
즉 
Person객체는 Eat객체를 인스턴스로 사용하고 있으므로, Eat객체에 의존성이 생긴다.
만약 이때, Eat 객체에 중요한 수정이나 오류가 발생한다면, Person 객체도 영향을 받을 수 있다. 

의존성을 가지는 코드가 많아진다면, 재활용성이 떨어지고 매번 의존성을 가지는 객체들을 함께 수정해 주어야 한다는 문제가 발생한다.
이러한 의존성을 해결하기 위해 나온 개념이 바로 Dependency Injection, 의존성 주입이다.


### 의존성 주입이란

Injection(주입) - 외부에서 객체를 생성해서 넣는 것을 의미한다.

ex) 클래스라면 생성자 등을 활용해 외부에서 주입이 가능하다


의존성 주입을 하는 장점중
1. 객체 간의 의존성(종속성)을 줄이거나 없엘 수 있다.
2. 코드의 재활용성을 높여준다

가 있다


이렇게 의존성 주입을 하기 위해선 그 전에 의존 관계 역전 법칙을 알아야 한다

의존 관계 역전 법칙은 객체 지향 프로그래밍 설계의 다섯가지 기본 원칙(SOLID) 중 하나이며

기본적으론 의존성과 의존성 주입에 대해 왜 해야하는지를 알았으며 의존성 주입은 아까처럼 외부껄 넣어서 의존성을 줄이므로 사용이 가능하지만
더 잘 사용하기위해 의존 관계 역전 법칙등 다른것들도 알 필요가 있다 -> 일단 기본 의존성의 개념까진 이렇고 해당 설계 기본 원칙들은 나중에 궁금하면 찾아보자